# Taps
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'httpie'
# brew 'mackup' #Turned off due to causing issues with macOS Sonoma
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Apps
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'arq'
cask 'chatgpt'
cask 'cleanshot'
cask 'cursor'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'herd'
cask 'httpie'
cask 'limitless'
cask 'logi-options+'
cask 'loom'
cask 'linear-linear'
cask 'microsoft-office'
cask 'missive'
cask 'nova'
cask 'notion'
cask 'notion-calendar'
cask 'phpstorm'
cask 'quip'
cask 'raycast'
cask 'rectangle-pro'
cask 'reflect'
cask 'soulver'
cask 'spotify'
cask 'slack'
cask 'superhuman'
cask 'tableplus'
cask 'tableau'
cask 'tailscale'
cask 'tinkerwell'
cask 'transmit'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'whimsical'
cask 'wordpresscom-studio'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas '1Password for Safari', id: 1569813296
mas 'Bear: Markdown Notes', id: 1091189122
mas 'Day One', id: 1055511498
mas 'Endel', id: 1346247457
mas 'Harvest', id: 506189836
mas 'Mela - Recipe Manager', id: 1568924476
mas 'Prompt 3', id: 1594420480
mas 'Soulver 3', id: 1508732804
mas 'Things', id: 904280696
mas 'Velja', id: 1607635845
mas 'Windows App', id: 1295203466

