# Taps
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'httpie'
# brew 'mackup' #Turned off due to causing issues with macOS Sonoma
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Apps
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'cleanshot'
cask 'figma'
cask 'google-chrome'
cask 'google-drive'
cask 'linear-linear'
cask 'missive'
cask 'notion'
cask 'rectangle'
cask 'steam'
cask 'slack'
cask 'transmit'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'windsurf'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas 'Harvest', id: 506189836
mas 'Hidden Bar', id: 1452453066
mas 'Velja', id: 1607635845
